1C/InformationRegisters/EPA_НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>EPA_НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИнтегрированСEPAction</Name>
					<Comment>Интегрирован  c Easy peasy action</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СложностьЗаданий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EPA_СложностьЗаданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EPA_ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>180</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Устройство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EPA_УстройстваПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.EPA_Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1C/InformationRegisters/EPA_НастройкиПользователей/Ext/ManagerModule.bsl
Процедура ЗаполнитьДанныеПользователя(Пользователь, ДанныеПользователя) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Пользователь = Пользователь;
	Если ТипЗнч(ДанныеПользователя) = Тип("Структура") Тогда
		НоваяЗапись.email = ДанныеПользователя.email;
		НоваяЗапись.EPA_ID = ДанныеПользователя.id;
		НоваяЗапись.ИнтегрированСEPAction  = Истина;
		НоваяЗапись.СложностьЗаданий = Перечисления.EPA_СложностьЗаданий.ПолучитьЗначениеПеречисления(ДанныеПользователя.task_type); 
		
		device_id = ДанныеПользователя.Свойство("device_id");
		
		Если device_id Тогда
			НоваяЗапись.Устройство = Справочники.EPA_УстройстваПользователей.СоздатьУстройство(ДанныеПользователя.device_id);		
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеПользователя) = Тип("Соответствие") Тогда 
		НоваяЗапись.email = ДанныеПользователя.Получить("email");
		НоваяЗапись.EPA_ID = ДанныеПользователя.Получить("id");
		НоваяЗапись.ИнтегрированСEPAction  = Истина;
		НоваяЗапись.СложностьЗаданий = Перечисления.EPA_СложностьЗаданий.ПолучитьЗначениеПеречисления(ДанныеПользователя.Получить("task_type"));
		device_id = ДанныеПользователя.Получить("device_id");
		
		Если device_id <> Неопределено Тогда
			НоваяЗапись.Устройство = Справочники.EPA_УстройстваПользователей.СоздатьУстройство(device_id);		
		КонецЕсли;
		
	КонецЕсли;
	НаборЗаписей.Записать();

КонецПроцедуры

Функция ПолучитьДанныеПользователя(Пользователь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	EPA_НастройкиПользователей.EPA_ID КАК EPA_ID,
		|	EPA_НастройкиПользователей.email КАК email,
		|	EPA_НастройкиПользователей.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.EPA_НастройкиПользователей КАК EPA_НастройкиПользователей
		|ГДЕ
		|	EPA_НастройкиПользователей.ИнтегрированСEPAction
		|	И EPA_НастройкиПользователей.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователь); 
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;		
	КонецЕсли;
	
	Запись = РезультатЗапроса.Выбрать();
	Запись.Следующий();
	
	Возврат Новый Структура("Пользователь, EPA_ID, email", Запись.Пользователь, Запись.EPA_ID, Запись.email);
	
КонецФункции
